open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_jpeg_decoder.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP JPEG decoder typed helper.  The immutable v3.1.1.9 bundle
 * exports the high-level hardware decoder from libbk_jpeg_decoder.a.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/cache.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>

#include <common/bk_err.h>
#include <components/avdk_utils/avdk_error.h>
#include <components/media_types.h>

#include <arch/chip/bk7258_jpeg_decoder.h>

/* The v3.1.1.9 jpeg_dec_driver.c routes JPEGDEC to CPU2 unconditionally.
 * AP NuttX executes on CPU1, so migrate the interrupt route after the SDK
 * decoder has opened.  sys_driver.h and sys_types.h are not exported by the
 * immutable bundle; these declarations/constants are the minimal ABI from
 * those v3.1.1.9 public driver symbols and the verified BK7258 definitions:
 * CPU1=1, CPU2=2, and JPEGDEC interrupt bit 26. */

extern int32_t sys_drv_core_intr_group1_enable(uint32_t core_id,
                                               uint32_t param);
extern int32_t sys_drv_core_intr_group1_disable(uint32_t core_id,
                                                uint32_t param);

#define BK7258_JPEGDEC_CPU1_CORE_ID          1u
#define BK7258_JPEGDEC_CPU2_CORE_ID          2u
#define BK7258_JPEGDEC_INTERRUPT_CTRL_BIT    (1u << 26)

/*
 * The v3.1.1.9 public bk_jpeg_decode_types.h includes frame_buffer.h, which
 * is not exported by the immutable AP bundle.  The complete frame_buffer_t
 * is nevertheless exported by media_types.h, so use that public type here.
 * Keep only the JPEG config/info/handle declarations needed to bridge the
 * leaked public include; the implementations remain in immutable
 * libbk_jpeg_decoder.a.  Image information is parsed locally because the SDK
 * parser is not bounded for untrusted buffers.
 */

typedef struct
{
  bk_err_t (*in_complete)(frame_buffer_t *in_frame);
  frame_buffer_t *(*out_malloc)(uint32_t size);
  bk_err_t (*out_complete)(uint32_t format_type, uint32_t result,
                           frame_buffer_t *out_frame);
} bk7258_sdk_jpeg_decode_callback_t;

typedef struct
{
  bk7258_sdk_jpeg_decode_callback_t decode_cbs;
} bk7258_sdk_jpeg_decode_hw_config_t;

typedef struct bk7258_sdk_jpeg_decode_hw_s
  *bk7258_sdk_jpeg_decode_hw_handle_t;

extern avdk_err_t bk_hardware_jpeg_decode_new(
  bk7258_sdk_jpeg_decode_hw_handle_t *handle,
  bk7258_sdk_jpeg_decode_hw_config_t *config);
extern avdk_err_t bk_jpeg_decode_hw_open(
  bk7258_sdk_jpeg_decode_hw_handle_t handle);
extern avdk_err_t bk_jpeg_decode_hw_close(
  bk7258_sdk_jpeg_decode_hw_handle_t handle);
extern avdk_err_t bk_jpeg_decode_hw_decode(
  bk7258_sdk_jpeg_decode_hw_handle_t handle,
  frame_buffer_t *in_frame,
  frame_buffer_t *out_frame);
extern avdk_err_t bk_jpeg_decode_hw_delete(
  bk7258_sdk_jpeg_decode_hw_handle_t handle);

#define BK7258_JPEG_YUV_PIXEL_BYTES 2u
#define BK7258_JPEG_DMA_READ_GUARD  2048u

#define BK7258_JPEG_MARKER_PREFIX   0xffu
#define BK7258_JPEG_MARKER_SOF0     0xc0u
#define BK7258_JPEG_MARKER_DHT      0xc4u
#define BK7258_JPEG_MARKER_SOI      0xd8u
#define BK7258_JPEG_MARKER_EOI      0xd9u
#define BK7258_JPEG_MARKER_SOS      0xdau
#define BK7258_JPEG_MARKER_DQT      0xdbu
#define BK7258_JPEG_MARKER_DRI      0xddu
#define BK7258_JPEG_MARKER_COM      0xfeu
#define BK7258_JPEG_MARKER_APP0     0xe0u
#define BK7258_JPEG_MARKER_APP15    0xefu

#define BK7258_JPEG_SOF0_PRECISION  8u
#define BK7258_JPEG_SOF0_COMPONENTS 3u
#define BK7258_JPEG_SOF0_LENGTH     17u
#define BK7258_JPEG_SAMPLE_444      0x11u
#define BK7258_JPEG_SAMPLE_422      0x21u
#define BK7258_JPEG_SAMPLE_420      0x22u

#define BK7258_JPEG_DQT_RECORD_SIZE 65u
#define BK7258_JPEG_DQT_TABLE0_BIT  (1u << 0)
#define BK7258_JPEG_DQT_TABLE1_BIT  (1u << 1)
#define BK7258_JPEG_DQT_REQUIRED    (BK7258_JPEG_DQT_TABLE0_BIT | \
                                     BK7258_JPEG_DQT_TABLE1_BIT)

#define BK7258_JPEG_DHT_COUNT_BYTES 16u
#define BK7258_JPEG_DHT_HEADER_SIZE (1u + BK7258_JPEG_DHT_COUNT_BYTES)
#define BK7258_JPEG_DHT_DC0_BIT     (1u << 0)
#define BK7258_JPEG_DHT_DC1_BIT     (1u << 1)
#define BK7258_JPEG_DHT_AC0_BIT     (1u << 2)
#define BK7258_JPEG_DHT_AC1_BIT     (1u << 3)
#define BK7258_JPEG_DHT_REQUIRED    (BK7258_JPEG_DHT_DC0_BIT | \
                                     BK7258_JPEG_DHT_DC1_BIT | \
                                     BK7258_JPEG_DHT_AC0_BIT | \
                                     BK7258_JPEG_DHT_AC1_BIT)
#define BK7258_JPEG_DHT_DC_SYMBOLS  12u
#define BK7258_JPEG_DHT_AC_SYMBOLS  162u
#define BK7258_JPEG_DHT_AC_SIZE_MAX 10u

struct bk7258_jpeg_decoder_s
{
  bk7258_sdk_jpeg_decode_hw_handle_t handle;
  FAR uint8_t *bounce;
  uint32_t bounce_capacity;
  bool initialized;
  bool opened;
  bool cpu1_route_enabled;
  bool operation_active;
  bool faulted;
  bool orphaned;
};

static mutex_t g_bk7258_jpeg_decoder_lock = NXMUTEX_INITIALIZER;
static struct bk7258_jpeg_decoder_s g_bk7258_jpeg_decoder;
static FAR struct bk7258_jpeg_decoder_s *g_bk7258_jpeg_decoder_owner;

static int bk7258_jpeg_decoder_sdk_error(avdk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case AVDK_ERR_INVAL:
      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
        return -EINVAL;

      case AVDK_ERR_NOMEM:
      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case AVDK_ERR_BUSY:
      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case AVDK_ERR_TIMEOUT:
      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case AVDK_ERR_NODEV:
      case BK_ERR_NO_DEV:
      case BK_ERR_NOT_INIT:
        return -ENODEV;

      case AVDK_ERR_UNSUPPORTED:
      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case AVDK_ERR_NO_RESOURCE:
        return -ENOMEM;

      case AVDK_ERR_SHUTDOWN:
      case BK_ERR_SHUT_DOWN:
        return -ESHUTDOWN;

