open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
      case BK_ERR_TRY_AGAIN:
        return -EAGAIN;

      case AVDK_ERR_GENERIC:
      case AVDK_ERR_HWERROR:
      case AVDK_ERR_IO:
      default:
        /* The SDK's fixed hardware timeout is reported as HWERROR by its
         * public synchronous path.  Do not manufacture -ETIMEDOUT here. */
        return -EIO;
    }
}

static int bk7258_jpeg_decoder_check_locked(
  FAR struct bk7258_jpeg_decoder_s *priv)
{
  if (priv == NULL)
    {
      return -EINVAL;
    }

  if (priv != g_bk7258_jpeg_decoder_owner || !priv->initialized ||
      !priv->opened || !priv->cpu1_route_enabled || priv->handle == NULL ||
      priv->orphaned)
    {
      return -ENODEV;
    }

  if (priv->faulted)
    {
      return -EIO;
    }

  return 0;
}

/* A failed initialize may itself encounter a close/delete failure.  Preserve
 * that unique SDK handle as a recovery-only owner instead of silently losing
 * it and allowing a second hardware instance to be constructed.
 */

static FAR struct bk7258_jpeg_decoder_s *
bk7258_jpeg_decoder_retain_orphan_locked(
  bk7258_sdk_jpeg_decode_hw_handle_t handle, bool opened)
{
  g_bk7258_jpeg_decoder.handle = handle;
  g_bk7258_jpeg_decoder.bounce = NULL;
  g_bk7258_jpeg_decoder.bounce_capacity = 0;
  g_bk7258_jpeg_decoder.initialized = true;
  g_bk7258_jpeg_decoder.opened = opened;
  g_bk7258_jpeg_decoder.cpu1_route_enabled = false;
  g_bk7258_jpeg_decoder.operation_active = false;
  g_bk7258_jpeg_decoder.faulted = true;
  g_bk7258_jpeg_decoder.orphaned = true;
  g_bk7258_jpeg_decoder_owner = &g_bk7258_jpeg_decoder;
  return g_bk7258_jpeg_decoder_owner;
}

static int bk7258_jpeg_decoder_route_to_cpu1(void)
{
  int ret;

  /* v3.1.1.9 disable returns the pre-update enable register, not an errno.
   * Match the verified SDK consumers: perform the disable and only test the
   * zero-on-success enable operation below. */

  (void)sys_drv_core_intr_group1_disable(BK7258_JPEGDEC_CPU2_CORE_ID,
                                         BK7258_JPEGDEC_INTERRUPT_CTRL_BIT);

  ret = sys_drv_core_intr_group1_enable(BK7258_JPEGDEC_CPU1_CORE_ID,
                                        BK7258_JPEGDEC_INTERRUPT_CTRL_BIT);
  if (ret != 0)
    {
      (void)sys_drv_core_intr_group1_disable(
        BK7258_JPEGDEC_CPU1_CORE_ID, BK7258_JPEGDEC_INTERRUPT_CTRL_BIT);
      return -EIO;
    }

  return 0;
}

static int bk7258_jpeg_decoder_route_from_cpu1(void)
{
  /* Disable returns the pre-update enable register, not an errno. */

  (void)sys_drv_core_intr_group1_disable(BK7258_JPEGDEC_CPU1_CORE_ID,
                                         BK7258_JPEGDEC_INTERRUPT_CTRL_BIT);
  return 0;
}

/* The SDK passes addresses to a 32-bit JPEG register interface.  Reject a
 * range whose final byte cannot be represented by that interface, even when
 * this wrapper is syntax-checked on a wider host. */

static int bk7258_jpeg_decoder_validate_sdk_address(
  FAR const uint8_t *data, uint32_t span)
{
  uint64_t base;
  uint64_t last;

  if (data == NULL || span == 0)
    {
      return -EINVAL;
    }

  base = (uint64_t)(uintptr_t)data;
  if (base > UINT64_MAX - span)
    {
      return -EOVERFLOW;
    }

  last = base + span - 1;
  if (last > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  return 0;
}

static int bk7258_jpeg_decoder_validate_input(
  FAR const struct bk7258_jpeg_decoder_frame_s *input)
{
  int ret;

  if (input == NULL || input->data == NULL || input->capacity == 0 ||
      input->length == 0 || input->length > input->capacity)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_decoder_validate_sdk_address(input->data,
                                                 input->length);
  if (ret < 0)
    {
      return ret;
    }

  return bk7258_jpeg_decoder_validate_sdk_address(input->data,
                                                   input->capacity);
}

static int bk7258_jpeg_decoder_validate_output(
  FAR const struct bk7258_jpeg_decoder_frame_s *output)
{
  if (output == NULL || output->data == NULL || output->capacity == 0)
    {
      return -EINVAL;
    }

  return bk7258_jpeg_decoder_validate_sdk_address(output->data,
                                                  output->capacity);
}

/* Invalidating a partial cache line can discard unrelated caller data.  The
 * decoder therefore accepts only an output range whose payload occupies
 * whole, caller-owned cache lines.  Keep this check separate from the basic
 * descriptor validation because the required span depends on JPEG metadata.
 */

static int bk7258_jpeg_decoder_output_cache_span(
  FAR const struct bk7258_jpeg_decoder_frame_s *output,
  size_t payload,
  FAR uint32_t *span)
{
  uintptr_t base;
  size_t line;
  size_t rounded;

  if (output == NULL || span == NULL || payload == 0)
    {
      return -EINVAL;
    }

  line = up_get_dcache_linesize();
  if (line == 0)
    {
      /* The maintained AP handoff intentionally disables D-cache and maps
       * its DMA SRAM non-cacheable.  Keep a natural alignment contract in
       * that configuration; the cache maintenance helpers are no-ops.
       */

      line = sizeof(uintptr_t);
    }

  if ((line & (line - 1)) != 0)
    {
      return -EIO;
    }

  base = (uintptr_t)output->data;
  if ((base & (line - 1)) != 0)
    {
      return -EINVAL;
    }

  if (payload > SIZE_MAX - (line - 1))
    {
      return -EOVERFLOW;
    }

  rounded = (payload + line - 1) & ~(line - 1);
  if (rounded > UINT32_MAX || base > UINTPTR_MAX - rounded)
    {
      return -EOVERFLOW;
    }

  if (rounded > output->capacity)
    {
      return -ENOSPC;
    }

  *span = (uint32_t)rounded;
  return 0;
}

static int bk7258_jpeg_decoder_validate_no_overlap(
  FAR const struct bk7258_jpeg_decoder_frame_s *input,
  FAR const struct bk7258_jpeg_decoder_frame_s *output)
{
  uintptr_t input_start = (uintptr_t)input->data;
  uintptr_t output_start = (uintptr_t)output->data;
  uintptr_t input_end;
  uintptr_t output_end;

  if (input_start > UINTPTR_MAX - input->length ||
      output_start > UINTPTR_MAX - output->capacity)
    {
      return -EINVAL;
    }

  input_end = input_start + input->length;
  output_end = output_start + output->capacity;

  if (input_start < output_end && output_start < input_end)
    {
      return -EINVAL;
    }

