open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
  return 0;
}

static int bk7258_jpeg_decoder_make_input(
  FAR const struct bk7258_jpeg_decoder_frame_s *input,
  FAR frame_buffer_t *sdk_input)
{
  int ret = bk7258_jpeg_decoder_validate_input(input);

  if (ret < 0)
    {
      return ret;
    }

  *sdk_input = (frame_buffer_t){0};
  sdk_input->frame = input->data;
  sdk_input->size = input->capacity;
  sdk_input->length = input->length;
  sdk_input->fmt = PIXEL_FMT_JPEG;
  return 0;
}

static int bk7258_jpeg_decoder_make_output(
  FAR const struct bk7258_jpeg_decoder_frame_s *output,
  FAR frame_buffer_t *sdk_output)
{
  int ret = bk7258_jpeg_decoder_validate_output(output);

  if (ret < 0)
    {
      return ret;
    }

  *sdk_output = (frame_buffer_t){0};
  sdk_output->frame = output->data;
  sdk_output->size = output->capacity;
  sdk_output->fmt = PIXEL_FMT_YUYV;
  return 0;
}

/* The immutable HAL programs BASE_RD_LEN to compressed length + 2048.  A
 * caller-owned V4L2 buffer may end exactly at bytesused, so never expose it
 * directly to the JPEG bus master.  Grow and reuse a cache-line-exclusive
 * bounce, copy the payload, and zero the required read guard for each frame.
 */

static int bk7258_jpeg_decoder_prepare_bounce(
  FAR struct bk7258_jpeg_decoder_s *priv,
  FAR const struct bk7258_jpeg_decoder_frame_s *input)
{
  FAR uint8_t *replacement;
  FAR uint8_t *old;
  size_t alignment;
  size_t guarded;
  size_t allocated;
  uintptr_t start;
  int ret;

  if (priv == NULL || input == NULL)
    {
      return -EINVAL;
    }

  if (input->length > UINT32_MAX - BK7258_JPEG_DMA_READ_GUARD)
    {
      return -EOVERFLOW;
    }

  alignment = up_get_dcache_linesize();
  if (alignment == 0)
    {
      alignment = sizeof(uintptr_t);
    }

  if (alignment < sizeof(uintptr_t))
    {
      alignment = sizeof(uintptr_t);
    }

  if ((alignment & (alignment - 1)) != 0)
    {
      return -EIO;
    }

  guarded = (size_t)input->length + BK7258_JPEG_DMA_READ_GUARD;
  if (guarded > SIZE_MAX - (alignment - 1))
    {
      return -EOVERFLOW;
    }

  allocated = (guarded + alignment - 1) & ~(alignment - 1);
  if (allocated > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  if (priv->bounce == NULL || priv->bounce_capacity < allocated)
    {
      replacement = kmm_memalign(alignment, allocated);
      if (replacement == NULL)
        {
          return -ENOMEM;
        }

      ret = bk7258_jpeg_decoder_validate_sdk_address(
        replacement, (uint32_t)allocated);
      if (ret < 0)
        {
          kmm_free(replacement);
          return ret;
        }

      /* Preserve the usable old allocation until its replacement has
       * passed every allocation and DMA-address check.
       */

      old = priv->bounce;
      priv->bounce = replacement;
      priv->bounce_capacity = (uint32_t)allocated;
      if (old != NULL)
        {
          kmm_free(old);
        }
    }

  memcpy(priv->bounce, input->data, input->length);
  memset(priv->bounce + input->length, 0,
         guarded - input->length);

  start = (uintptr_t)priv->bounce;
  up_clean_dcache(start, start + guarded);

  return 0;
}

static bool bk7258_jpeg_decoder_is_sof(uint8_t marker)
{
  return marker >= 0xc0u && marker <= 0xcfu &&
         marker != BK7258_JPEG_MARKER_DHT && marker != 0xc8u &&
         marker != 0xccu;
}

static bool bk7258_jpeg_decoder_is_header_segment(uint8_t marker)
{
  return marker == BK7258_JPEG_MARKER_DHT ||
         marker == BK7258_JPEG_MARKER_DQT ||
         marker == BK7258_JPEG_MARKER_DRI ||
         marker == BK7258_JPEG_MARKER_COM ||
         (marker >= BK7258_JPEG_MARKER_APP0 &&
          marker <= BK7258_JPEG_MARKER_APP15);
}

static uint16_t bk7258_jpeg_decoder_get_be16(FAR const uint8_t *data)
{
  return ((uint16_t)data[0] << 8) | data[1];
}

static bool bk7258_jpeg_decoder_scan_matches(
  FAR const uint8_t component_ids[BK7258_JPEG_SOF0_COMPONENTS],
  FAR const uint8_t *scan)
{
  return scan[0] == BK7258_JPEG_SOF0_COMPONENTS &&
         scan[1] == component_ids[0] && scan[2] == 0x00u &&
         scan[3] == component_ids[1] && scan[4] == 0x11u &&
         scan[5] == component_ids[2] && scan[6] == 0x11u &&
         scan[7] == 0 && scan[8] == 63u && scan[9] == 0;
}

/* Admit only the two 8-bit quantization tables consumed by the pinned
 * v3.1.1.9 hardware path.  A DQT segment may contain one or both records,
 * but each table is defined exactly once across the complete header.
 */

static int bk7258_jpeg_decoder_validate_dqt(FAR const uint8_t *segment,
                                            uint16_t segment_length,
                                            FAR uint8_t *seen)
{
  FAR const uint8_t *record;
  size_t remaining;
  uint8_t table;
  uint8_t bit;
  unsigned int i;

  if (segment == NULL || seen == NULL || segment_length < 2)
    {
      return -EINVAL;
    }

  record = segment + 2;
  remaining = segment_length - 2;
  if (remaining == 0 ||
      (remaining % BK7258_JPEG_DQT_RECORD_SIZE) != 0)
    {
      return -EINVAL;
    }

  while (remaining != 0)
    {
      if ((record[0] >> 4) != 0 || (record[0] & 0x0fu) > 1u)
        {
          return -ENOTSUP;
        }

      table = record[0] & 0x0fu;
      bit = 1u << table;
      if ((*seen & bit) != 0)
        {
          return -ENOTSUP;
        }

      for (i = 1; i < BK7258_JPEG_DQT_RECORD_SIZE; i++)
        {
          if (record[i] == 0)
            {
              return -EINVAL;
            }
        }

      *seen |= bit;
      record += BK7258_JPEG_DQT_RECORD_SIZE;
      remaining -= BK7258_JPEG_DQT_RECORD_SIZE;
    }

  return 0;
}

static int bk7258_jpeg_decoder_validate_huffman_symbols(
  FAR const uint8_t *symbols, uint16_t count, bool ac)
{
  uint32_t seen[8] = {0};
  uint8_t symbol;
  uint8_t run;
  uint8_t size;
  uint32_t bit;
  unsigned int word;
  unsigned int i;

  for (i = 0; i < count; i++)
    {
      symbol = symbols[i];
      word = symbol >> 5;
      bit = 1u << (symbol & 31u);
      if ((seen[word] & bit) != 0)
        {
          return -EINVAL;
        }

      seen[word] |= bit;
      if (!ac)
        {
          if (symbol >= BK7258_JPEG_DHT_DC_SYMBOLS)
            {
              return -ENOTSUP;
            }

          continue;
        }

      run = symbol >> 4;
      size = symbol & 0x0fu;
      if (size > BK7258_JPEG_DHT_AC_SIZE_MAX ||
          (size == 0 && run != 0 && run != 15u))
        {
          return -ENOTSUP;
        }
    }

