open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
  return 0;
}

/* Validate canonical baseline Huffman records without constructing their
 * codes.  The available-slots recurrence rejects an over-subscribed prefix
 * tree while intentionally allowing the incomplete trees used by JPEG.
 */

static int bk7258_jpeg_decoder_validate_dht(FAR const uint8_t *segment,
                                            uint16_t segment_length,
                                            FAR uint8_t *seen)
{
  FAR const uint8_t *record;
  uint32_t available;
  uint16_t symbol_count;
  size_t record_size;
  size_t remaining;
  uint8_t table_class;
  uint8_t table_id;
  uint8_t bit;
  unsigned int i;
  int ret;

  if (segment == NULL || seen == NULL || segment_length < 2)
    {
      return -EINVAL;
    }

  record = segment + 2;
  remaining = segment_length - 2;
  if (remaining == 0)
    {
      return -EINVAL;
    }

  while (remaining != 0)
    {
      if (remaining < BK7258_JPEG_DHT_HEADER_SIZE)
        {
          return -EINVAL;
        }

      table_class = record[0] >> 4;
      table_id = record[0] & 0x0fu;
      if (table_class > 1u || table_id > 1u)
        {
          return -ENOTSUP;
        }

      symbol_count = 0;
      available = 1;
      for (i = 0; i < BK7258_JPEG_DHT_COUNT_BYTES; i++)
        {
          available <<= 1;
          if (record[1 + i] > available)
            {
              return -EINVAL;
            }

          available -= record[1 + i];
          symbol_count += record[1 + i];
        }

      /* JPEG canonical Huffman tables must leave at least one code point
       * unused.  A complete tree would assign the all-ones code, which the
       * format reserves for marker padding.
       */

      if (available == 0 || symbol_count == 0 ||
          (!table_class && symbol_count > BK7258_JPEG_DHT_DC_SYMBOLS) ||
          (table_class && symbol_count > BK7258_JPEG_DHT_AC_SYMBOLS))
        {
          return -ENOTSUP;
        }

      record_size = BK7258_JPEG_DHT_HEADER_SIZE + symbol_count;
      if (record_size > remaining)
        {
          return -EINVAL;
        }

      bit = 1u << (table_class * 2u + table_id);
      if ((*seen & bit) != 0)
        {
          return -ENOTSUP;
        }

      ret = bk7258_jpeg_decoder_validate_huffman_symbols(
        record + BK7258_JPEG_DHT_HEADER_SIZE, symbol_count,
        table_class != 0);
      if (ret < 0)
        {
          return ret;
        }

      *seen |= bit;
      record += record_size;
      remaining -= record_size;
    }

  return 0;
}

/* Scan a single baseline entropy-coded segment through EOI.  Marker fill,
 * byte stuffing, and restart markers are the only marker-like byte sequences
 * admitted inside the scan.  Requiring EOI to terminate bytesused prevents a
 * second scan or a concatenated/trailing stream from reaching the SDK.
 */

static int bk7258_jpeg_decoder_scan_entropy(FAR const uint8_t *data,
                                            size_t length,
                                            size_t offset)
{
  uint8_t marker;

  while (offset < length)
    {
      if (data[offset++] != BK7258_JPEG_MARKER_PREFIX)
        {
          continue;
        }

      if (offset >= length)
        {
          return -EINVAL;
        }

      do
        {
          marker = data[offset++];
        }
      while (marker == BK7258_JPEG_MARKER_PREFIX && offset < length);

      if (marker == BK7258_JPEG_MARKER_PREFIX)
        {
          return -EINVAL;
        }

      if (marker == 0 || (marker >= 0xd0u && marker <= 0xd7u))
        {
          continue;
        }

      if (marker == BK7258_JPEG_MARKER_EOI)
        {
          return offset == length ? 0 : -EINVAL;
        }

      return -ENOTSUP;
    }

  return -EINVAL;
}

/* Parse only bounded, baseline three-component JPEG headers.  The SDK's
 * bk_get_jpeg_data_info() walks segment lengths without first proving that
 * the referenced bytes are inside the caller's buffer.  Keep untrusted V4L2
 * buffers out of that public entry point and admit only a SOF0 layout that is
 * also accepted by the immutable hardware decoder.
 */

static int bk7258_jpeg_decoder_parse_info(
  FAR const struct bk7258_jpeg_decoder_frame_s *input,
  FAR struct bk7258_jpeg_decoder_info_s *info)
{
  FAR const uint8_t *data;
  FAR const uint8_t *scan;
  FAR const uint8_t *sof;
  struct bk7258_jpeg_decoder_info_s parsed = {0};
  uint8_t component_ids[BK7258_JPEG_SOF0_COMPONENTS] = {0};
  uint16_t segment_length;
  uint16_t width;
  uint16_t height;
  uint8_t marker;
  uint8_t y_sample;
  uint8_t dqt_seen = 0;
  uint8_t dht_seen = 0;
  bool sof_seen = false;
  size_t offset;
  int ret;

  if (info == NULL)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_decoder_validate_input(input);
  if (ret < 0)
    {
      return ret;
    }

  data = input->data;
  if (input->length < 4 || data[0] != BK7258_JPEG_MARKER_PREFIX ||
      data[1] != BK7258_JPEG_MARKER_SOI)
    {
      return -EINVAL;
    }

  offset = 2;
  while (offset < input->length)
    {
      if (data[offset] != BK7258_JPEG_MARKER_PREFIX)
        {
          return -EINVAL;
        }

      do
        {
          offset++;
        }
      while (offset < input->length &&
             data[offset] == BK7258_JPEG_MARKER_PREFIX);

      if (offset >= input->length)
        {
          return -EINVAL;
        }

      marker = data[offset++];
      if (marker == 0 || marker == BK7258_JPEG_MARKER_SOI ||
          marker == BK7258_JPEG_MARKER_EOI ||
          (marker >= 0xd0u && marker <= 0xd7u))
        {
          return -EINVAL;
        }

      if (bk7258_jpeg_decoder_is_sof(marker) &&
          marker != BK7258_JPEG_MARKER_SOF0)
        {
          return -ENOTSUP;
        }

      if (marker != BK7258_JPEG_MARKER_SOF0 &&
          marker != BK7258_JPEG_MARKER_SOS &&
          !bk7258_jpeg_decoder_is_header_segment(marker))
        {
          return -ENOTSUP;
        }

      if (input->length - offset < 2)
        {
          return -EINVAL;
        }

      segment_length = bk7258_jpeg_decoder_get_be16(&data[offset]);
      if (segment_length < 2 ||
          segment_length > input->length - offset)
        {
          return -EINVAL;
        }

      if (marker == BK7258_JPEG_MARKER_SOS)
        {
          if (!sof_seen)
            {
              return -EINVAL;
            }

