open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
          if (segment_length != 12u || dqt_seen != BK7258_JPEG_DQT_REQUIRED ||
              dht_seen != BK7258_JPEG_DHT_REQUIRED)
            {
              return -ENOTSUP;
            }

          scan = &data[offset + 2];
          if (!bk7258_jpeg_decoder_scan_matches(component_ids, scan))
            {
              return -ENOTSUP;
            }

          ret = bk7258_jpeg_decoder_scan_entropy(
            data, input->length, offset + segment_length);
          if (ret < 0)
            {
              return ret;
            }

          *info = parsed;
          return 0;
        }

      if (marker == BK7258_JPEG_MARKER_DQT)
        {
          ret = bk7258_jpeg_decoder_validate_dqt(&data[offset],
                                                 segment_length,
                                                 &dqt_seen);
          if (ret < 0)
            {
              return ret;
            }

          offset += segment_length;
          continue;
        }

      if (marker == BK7258_JPEG_MARKER_DHT)
        {
          ret = bk7258_jpeg_decoder_validate_dht(&data[offset],
                                                 segment_length,
                                                 &dht_seen);
          if (ret < 0)
            {
              return ret;
            }

          offset += segment_length;
          continue;
        }

      if (marker == BK7258_JPEG_MARKER_DRI)
        {
          if (segment_length != 4u)
            {
              return -ENOTSUP;
            }

          offset += segment_length;
          continue;
        }

      if (marker != BK7258_JPEG_MARKER_SOF0)
        {
          offset += segment_length;
          continue;
        }

      if (sof_seen)
        {
          return -ENOTSUP;
        }

      if (segment_length != BK7258_JPEG_SOF0_LENGTH)
        {
          return -ENOTSUP;
        }

      sof = &data[offset + 2];
      if (sof[0] != BK7258_JPEG_SOF0_PRECISION ||
          sof[5] != BK7258_JPEG_SOF0_COMPONENTS)
        {
          return -ENOTSUP;
        }

      height = bk7258_jpeg_decoder_get_be16(&sof[1]);
      width = bk7258_jpeg_decoder_get_be16(&sof[3]);
      if (width == 0 || height == 0)
        {
          return -EINVAL;
        }

      /* The hardware path consumes components in Y, Cb, Cr order.  Require
       * unique IDs, one of the three supported Y sampling factors, 1x1
       * chroma sampling, and valid baseline quantization-table selectors.
       */

      if (sof[6] == sof[9] || sof[6] == sof[12] ||
          sof[9] == sof[12] || sof[8] != 0 || sof[11] != 1u ||
          sof[14] != 1u || sof[10] != BK7258_JPEG_SAMPLE_444 ||
          sof[13] != BK7258_JPEG_SAMPLE_444)
        {
          return -ENOTSUP;
        }

      y_sample = sof[7];
      switch (y_sample)
        {
          case BK7258_JPEG_SAMPLE_444:
            parsed.format = BK7258_JPEG_DECODER_YUV444;
            break;

          case BK7258_JPEG_SAMPLE_422:
            parsed.format = BK7258_JPEG_DECODER_YUV422;
            break;

          case BK7258_JPEG_SAMPLE_420:
            parsed.format = BK7258_JPEG_DECODER_YUV420;
            break;

          default:
            return -ENOTSUP;
        }

      component_ids[0] = sof[6];
      component_ids[1] = sof[9];
      component_ids[2] = sof[12];
      parsed.width = width;
      parsed.height = height;
      sof_seen = true;
      offset += segment_length;
    }

  return -EINVAL;
}

static int bk7258_jpeg_decoder_get_info_locked(
  FAR struct bk7258_jpeg_decoder_s *priv,
  FAR struct bk7258_jpeg_decoder_frame_s *input,
  FAR struct bk7258_jpeg_decoder_info_s *info)
{
  (void)priv;
  return bk7258_jpeg_decoder_parse_info(input, info);
}

int bk7258_jpeg_decoder_initialize(FAR struct bk7258_jpeg_decoder_s **out)
{
  bk7258_sdk_jpeg_decode_hw_config_t config = {0};
  bk7258_sdk_jpeg_decode_hw_handle_t handle = NULL;
  avdk_err_t sdkret;
  int cleanup_ret;
  int ret;

  if (out == NULL)
    {
      return -EINVAL;
    }

  *out = NULL;
  ret = nxmutex_lock(&g_bk7258_jpeg_decoder_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_jpeg_decoder_owner != NULL)
    {
      if (g_bk7258_jpeg_decoder_owner->orphaned)
        {
          /* Return the recovery-only handle so a caller that did not retain
           * it from the original failed initialize can retry uninitialize.
           */

          *out = g_bk7258_jpeg_decoder_owner;
          nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
          return -EIO;
        }

      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return -EBUSY;
    }

  sdkret = bk_hardware_jpeg_decode_new(&handle, &config);
  ret = bk7258_jpeg_decoder_sdk_error(sdkret);
  if (ret < 0 || handle == NULL)
    {
      if (ret >= 0)
        {
          ret = -EIO;
        }

      if (handle != NULL)
        {
          sdkret = bk_jpeg_decode_hw_delete(handle);
          cleanup_ret = bk7258_jpeg_decoder_sdk_error(sdkret);
          if (cleanup_ret < 0)
            {
              *out = bk7258_jpeg_decoder_retain_orphan_locked(handle,
                                                              false);
              ret = cleanup_ret;
            }
        }

      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return ret;
    }

  sdkret = bk_jpeg_decode_hw_open(handle);
  ret = bk7258_jpeg_decoder_sdk_error(sdkret);
  if (ret < 0)
    {
      /* A failed open leaves the SDK controller disabled on its normal
       * path, so delete is the documented failure cleanup. */

      sdkret = bk_jpeg_decode_hw_delete(handle);
      cleanup_ret = bk7258_jpeg_decoder_sdk_error(sdkret);
      if (cleanup_ret < 0)
        {
          *out = bk7258_jpeg_decoder_retain_orphan_locked(handle, false);
          ret = cleanup_ret;
        }

      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return ret;
    }

  ret = bk7258_jpeg_decoder_route_to_cpu1();
  if (ret < 0)
    {
      /* The SDK open path has already registered its ISR and enabled the
       * CPU2 route.  Always close/delete on migration failure; close repeats
       * the SDK's CPU2 disable and the route helper clears any CPU1 partial
       * state. */

      sdkret = bk_jpeg_decode_hw_close(handle);
      cleanup_ret = bk7258_jpeg_decoder_sdk_error(sdkret);
      if (cleanup_ret < 0)
        {
          *out = bk7258_jpeg_decoder_retain_orphan_locked(handle, true);
          nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
          return cleanup_ret;
        }

      sdkret = bk_jpeg_decode_hw_delete(handle);
      cleanup_ret = bk7258_jpeg_decoder_sdk_error(sdkret);
      if (cleanup_ret < 0)
        {
          *out = bk7258_jpeg_decoder_retain_orphan_locked(handle, false);
          nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
          return cleanup_ret;
        }

      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return -EIO;
    }

  g_bk7258_jpeg_decoder.handle = handle;
  g_bk7258_jpeg_decoder.bounce = NULL;
  g_bk7258_jpeg_decoder.bounce_capacity = 0;
  g_bk7258_jpeg_decoder.initialized = true;
  g_bk7258_jpeg_decoder.opened = true;
  g_bk7258_jpeg_decoder.cpu1_route_enabled = true;
  g_bk7258_jpeg_decoder.operation_active = false;
  g_bk7258_jpeg_decoder.faulted = false;
  g_bk7258_jpeg_decoder.orphaned = false;
  g_bk7258_jpeg_decoder_owner = &g_bk7258_jpeg_decoder;
  *out = g_bk7258_jpeg_decoder_owner;

  nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
  return 0;
}

int bk7258_jpeg_decoder_uninitialize(FAR struct bk7258_jpeg_decoder_s *priv)
{
  avdk_err_t sdkret;
  int ret;

  if (priv == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_bk7258_jpeg_decoder_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv != g_bk7258_jpeg_decoder_owner || !priv->initialized)
    {
      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return -EINVAL;
    }

  if (priv->operation_active)
    {
      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return -EBUSY;
    }

  if (priv->opened)
    {
      sdkret = bk_jpeg_decode_hw_close(priv->handle);
      ret = bk7258_jpeg_decoder_sdk_error(sdkret);
      if (ret < 0)
        {
          nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
          return ret;
        }

      priv->opened = false;
    }

  if (priv->cpu1_route_enabled)
    {
      ret = bk7258_jpeg_decoder_route_from_cpu1();
      if (ret < 0)
        {
          /* Keep ownership and the closed handle so a later uninitialize
           * can retry the CPU1 route disable before deleting the controller. */
          nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
          return ret;
        }

      priv->cpu1_route_enabled = false;
    }

