open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_decoder.c
  sdkret = bk_jpeg_decode_hw_delete(priv->handle);
  ret = bk7258_jpeg_decoder_sdk_error(sdkret);
  if (ret < 0)
    {
      /* Keep ownership and the closed handle so a later uninitialize can
       * retry deletion without allowing a second SDK instance. */
      nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
      return ret;
    }

  if (priv->bounce != NULL)
    {
      kmm_free(priv->bounce);
      priv->bounce = NULL;
    }

  priv->bounce_capacity = 0;
  priv->handle = NULL;
  priv->initialized = false;
  priv->operation_active = false;
  priv->faulted = false;
  priv->orphaned = false;
  g_bk7258_jpeg_decoder_owner = NULL;

  nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
  return 0;
}

int bk7258_jpeg_decoder_get_info(
  FAR struct bk7258_jpeg_decoder_s *priv,
  FAR struct bk7258_jpeg_decoder_frame_s *input,
  FAR struct bk7258_jpeg_decoder_info_s *info)
{
  int ret;

  if (info == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_bk7258_jpeg_decoder_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_decoder_check_locked(priv);
  if (ret >= 0)
    {
      ret = bk7258_jpeg_decoder_get_info_locked(priv, input, info);
    }

  nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
  return ret;
}

int bk7258_jpeg_decoder_decode(
  FAR struct bk7258_jpeg_decoder_s *priv,
  FAR struct bk7258_jpeg_decoder_frame_s *input,
  FAR struct bk7258_jpeg_decoder_frame_s *output)
{
  struct bk7258_jpeg_decoder_frame_s guarded_input;
  frame_buffer_t sdk_input;
  frame_buffer_t sdk_output;
  struct bk7258_jpeg_decoder_info_s info;
  uint64_t output_bytes;
  uint32_t output_cache_span;
  uintptr_t output_start;
  avdk_err_t sdkret;
  int ret;

  if (output != NULL)
    {
      output->length = 0;
    }

  ret = bk7258_jpeg_decoder_validate_input(input);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_decoder_validate_output(output);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_decoder_validate_no_overlap(input, output);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&g_bk7258_jpeg_decoder_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_decoder_check_locked(priv);
  if (ret < 0)
    {
      goto out_unlock;
    }

  if (priv->operation_active)
    {
      ret = -EBUSY;
      goto out_unlock;
    }

  ret = bk7258_jpeg_decoder_get_info_locked(priv, input, &info);
  if (ret < 0)
    {
      goto out_unlock;
    }

  output_bytes = (uint64_t)info.width * info.height *
                 BK7258_JPEG_YUV_PIXEL_BYTES;
  if (output_bytes > UINT32_MAX || output_bytes > output->capacity)
    {
      ret = -ENOSPC;
      goto out_unlock;
    }

  ret = bk7258_jpeg_decoder_output_cache_span(
    output, (size_t)output_bytes, &output_cache_span);
  if (ret < 0)
    {
      goto out_unlock;
    }

  ret = bk7258_jpeg_decoder_prepare_bounce(priv, input);
  if (ret < 0)
    {
      goto out_unlock;
    }

  guarded_input = *input;
  guarded_input.data = priv->bounce;
  guarded_input.capacity = priv->bounce_capacity;
  ret = bk7258_jpeg_decoder_make_input(&guarded_input, &sdk_input);
  if (ret < 0)
    {
      goto out_unlock;
    }

  ret = bk7258_jpeg_decoder_make_output(output, &sdk_output);
  if (ret < 0)
    {
      goto out_unlock;
    }

  sdk_input.width = (uint16_t)info.width;
  sdk_input.height = (uint16_t)info.height;
  sdk_output.width = (uint16_t)info.width;
  sdk_output.height = (uint16_t)info.height;

  output_start = (uintptr_t)output->data;
  up_flush_dcache(output_start,
                  output_start + (uintptr_t)output_cache_span);

  priv->operation_active = true;
  sdkret = bk_jpeg_decode_hw_decode(priv->handle, &sdk_input, &sdk_output);
  priv->operation_active = false;

  /* A timeout or malformed stream can leave partially written cache lines.
   * Drop them even when the frame is returned as an error.
   */

  up_invalidate_dcache(output_start,
                       output_start + (uintptr_t)output_cache_span);

  ret = bk7258_jpeg_decoder_sdk_error(sdkret);
  if (ret >= 0 &&
      (sdk_output.width != info.width || sdk_output.height != info.height))
    {
      ret = -EIO;
    }

  if (ret < 0)
    {
      /* Some immediate SDK start failures leave its global state BUSY.  Do
       * not admit another frame through a possibly poisoned controller; the
       * sole media owner must uninitialize and create a fresh generation.
       */

      priv->faulted = true;
      ret = -EIO;
    }
  else
    {
      input->width = sdk_input.width;
      input->height = sdk_input.height;
      output->width = sdk_output.width;
      output->height = sdk_output.height;
      output->length = (uint32_t)output_bytes;
    }

out_unlock:
  nxmutex_unlock(&g_bk7258_jpeg_decoder_lock);
  return ret;
}
